2D_Plane_LES/system/include/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

probes
{
    type            probes;
    libs            ("libsampling.so");
    writeControl    timeStep;
    writeInterval   1;

    fields
    (
        p
    );

    probeLocations
    (
        (5 2 0)
        (7.5 2 0)
        (10 2 0)
        (12.5 2 0)
        (15 2 0)
        (20 2 0)
        (40 2 0)
        (80 2 0)
        (5 1 0)
        (7.5 1 0)
        (10 1 0)
        (12.5 1 0)
        (15 1 0)
        (20 1 0)
        (40 1 0)
        (80 1 0)            
    );
        
    fields
    (
        U
    );

    probeLocations
    (
        (5 2 0)            
    );

}

// ************************************************************************* //
